{
  "backend/main.mo": "Defines player profiles and a map of profiles plus a list of 20 luxury car definitions with stats and unlock costs.",
  "feature_evidence.json": "Lists implemented features, associated files, components, and test IDs for authentication, garage, racing, and missions.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for each frontend file, describing styling, components, pages, game data, and hooks.",
  "frontend/index.css": "Sets up Tailwind base styles and OKLCH color variables for light/dark themes with global background and text rules.",
  "frontend/index.html": "Minimal HTML shell loading the React app entry point.",
  "frontend/src/api/playerApi.ts": "Manages guest-mode player profiles in localStorage with currency updates and car ownership operations.",
  "frontend/src/App.tsx": "Configures router, theme, and authentication gating, routing authenticated users into the main game layout.",
  "frontend/src/auth/guestSession.ts": "Handles creation, retrieval, and clearing of guest session IDs via localStorage.",
  "frontend/src/auth/useAuthMode.ts": "Combines guest and Internet Identity auth states and exposes current mode, display name, and sign-out logic.",
  "frontend/src/auth/useGuestSession.ts": "React hook exposing guest session state with start/end session helpers.",
  "frontend/src/components/CurrencyBalances.tsx": "Displays gold and diamond balances, switching between backend and guest profiles with periodic updates in guest mode.",
  "frontend/src/components/GameLayout.tsx": "Defines the main authenticated layout with header, navigation, routed content, and footer.",
  "frontend/src/components/HeaderBar.tsx": "Renders the top header with logo, currency balances, and a user dropdown showing auth mode and sign-out option.",
  "frontend/src/components/NavigationBar.tsx": "Provides a horizontal navigation bar with links and icons, highlighting the active route.",
  "frontend/src/components/PlayerProgress.tsx": "Displays player level, race stats, and XP progress based on either backend or local profile data.",
  "frontend/src/gameData/diamondPacks.ts": "Defines the DiamondPack interface and a list of purchasable diamond packs with prices and bonuses.",
  "frontend/src/gameData/luxuryCars.ts": "Provides the LuxuryCar interface and a catalog of cars with stats, rarity, unlock costs, and image paths.",
  "frontend/src/gameData/missions.ts": "Contains mission definitions including daily, weekly, and achievement tasks with targets and gold rewards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication state, login, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, cars, purchases, selections, and leaderboard interactions via the actor.",
  "frontend/src/index.css": "Tailwind setup with custom themes, colors, and utility classes for light/dark modes and UI styling.",
  "frontend/src/lib/utils.ts": "Exports a cn utility combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AuthPage.tsx": "Login screen allowing users to sign in with Internet Identity or start a guest session.",
  "frontend/src/pages/GaragePage.tsx": "Displays the user's car collection with filters, and handles selecting or purchasing cars using local profile data.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing player progress, leaderboard highlights, and quick navigation actions.",
  "frontend/src/pages/MissionsPage.tsx": "Shows daily, weekly, and achievement missions, calculates progress, and lets users claim gold rewards.",
  "frontend/src/pages/RaceLobbyPage.tsx": "Interface to create or join race lobbies, generating lobby codes and managing current lobby state.",
  "frontend/src/pages/TopUpPage.tsx": "Presents diamond packs for purchase, updates local diamond balance, and tracks purchase history.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a non-real-time multiplayer racing game, its scope, authentication modes, image requirements, and architectural notes."
}